{"Ā": 0, "ā": 1, "Ă": 2, "ă": 3, "Ą": 4, "ą": 5, "Ć": 6, "ć": 7, "Ĉ": 8, "ĉ": 9, "Ċ": 10, "ċ": 11, "Č": 12, "č": 13, "Ď": 14, "ď": 15, "Đ": 16, "đ": 17, "Ē": 18, "ē": 19, "Ĕ": 20, "ĕ": 21, "Ė": 22, "ė": 23, "Ę": 24, "ę": 25, "Ě": 26, "ě": 27, "Ĝ": 28, "ĝ": 29, "Ğ": 30, "ğ": 31, "Ġ": 32, "!": 33, "\"": 34, "#": 35, "$": 36, "%": 37, "&": 38, "'": 39, "(": 40, ")": 41, "*": 42, "+": 43, ",": 44, "-": 45, ".": 46, "/": 47, "0": 48, "1": 49, "2": 50, "3": 51, "4": 52, "5": 53, "6": 54, "7": 55, "8": 56, "9": 57, ":": 58, ";": 59, "<": 60, "=": 61, ">": 62, "?": 63, "@": 64, "A": 65, "B": 66, "C": 67, "D": 68, "E": 69, "F": 70, "G": 71, "H": 72, "I": 73, "J": 74, "K": 75, "L": 76, "M": 77, "N": 78, "O": 79, "P": 80, "Q": 81, "R": 82, "S": 83, "T": 84, "U": 85, "V": 86, "W": 87, "X": 88, "Y": 89, "Z": 90, "[": 91, "\\": 92, "]": 93, "^": 94, "_": 95, "`": 96, "a": 97, "b": 98, "c": 99, "d": 100, "e": 101, "f": 102, "g": 103, "h": 104, "i": 105, "j": 106, "k": 107, "l": 108, "m": 109, "n": 110, "o": 111, "p": 112, "q": 113, "r": 114, "s": 115, "t": 116, "u": 117, "v": 118, "w": 119, "x": 120, "y": 121, "z": 122, "{": 123, "|": 124, "}": 125, "~": 126, "ġ": 127, "Ģ": 128, "ģ": 129, "Ĥ": 130, "ĥ": 131, "Ħ": 132, "ħ": 133, "Ĩ": 134, "ĩ": 135, "Ī": 136, "ī": 137, "Ĭ": 138, "ĭ": 139, "Į": 140, "į": 141, "İ": 142, "ı": 143, "Ĳ": 144, "ĳ": 145, "Ĵ": 146, "ĵ": 147, "Ķ": 148, "ķ": 149, "ĸ": 150, "Ĺ": 151, "ĺ": 152, "Ļ": 153, "ļ": 154, "Ľ": 155, "ľ": 156, "Ŀ": 157, "ŀ": 158, "Ł": 159, "ł": 160, "¡": 161, "¢": 162, "£": 163, "¤": 164, "¥": 165, "¦": 166, "§": 167, "¨": 168, "©": 169, "ª": 170, "«": 171, "¬": 172, "Ń": 173, "®": 174, "¯": 175, "°": 176, "±": 177, "²": 178, "³": 179, "´": 180, "µ": 181, "¶": 182, "·": 183, "¸": 184, "¹": 185, "º": 186, "»": 187, "¼": 188, "½": 189, "¾": 190, "¿": 191, "À": 192, "Á": 193, "Â": 194, "Ã": 195, "Ä": 196, "Å": 197, "Æ": 198, "Ç": 199, "È": 200, "É": 201, "Ê": 202, "Ë": 203, "Ì": 204, "Í": 205, "Î": 206, "Ï": 207, "Ð": 208, "Ñ": 209, "Ò": 210, "Ó": 211, "Ô": 212, "Õ": 213, "Ö": 214, "×": 215, "Ø": 216, "Ù": 217, "Ú": 218, "Û": 219, "Ü": 220, "Ý": 221, "Þ": 222, "ß": 223, "à": 224, "á": 225, "â": 226, "ã": 227, "ä": 228, "å": 229, "æ": 230, "ç": 231, "è": 232, "é": 233, "ê": 234, "ë": 235, "ì": 236, "í": 237, "î": 238, "ï": 239, "ð": 240, "ñ": 241, "ò": 242, "ó": 243, "ô": 244, "õ": 245, "ö": 246, "÷": 247, "ø": 248, "ù": 249, "ú": 250, "û": 251, "ü": 252, "ý": 253, "þ": 254, "ÿ": 255, "Ġt": 256, "at": 257, "Ġo": 258, "he": 259, "Ġa": 260, "Ġthe": 261, "on": 262, "in": 263, "re": 264, "Ġof": 265, "er": 266, "ar": 267, "en": 268, "es": 269, "Ġs": 270, "it": 271, "Ġto": 272, "ion": 273, "le": 274, "al": 275, "Ġin": 276, "ic": 277, "ent": 278, "or": 279, "uc": 280, "Ġan": 281, "Ġf": 282, "ĠT": 283, "ation": 284, "Ġn": 285, "Ġw": 286, "is": 287, "Ġd": 288, "Ġp": 289, "reat": 290, "ce": 291, "reaty": 292, "ĠTreaty": 293, "ment": 294, "ucle": 295, "uclear": 296, "os": 297, "ea": 298, "Ġor": 299, "Ġand": 300, "Ġc": 301, "Ġb": 302, "ed": 303, "Ġth": 304, "ing": 305, "Ġe": 306, "Ġnuclear": 307, "ĠS": 308, "an": 309, "Ġm": 310, "ve": 311, "ro": 312, "all": 313, "art": 314, "Ġfor": 315, "tat": 316, "ĠP": 317, "ĊĊ": 318, "ec": 319, "ĠStat": 320, "pon": 321, "Ġsh": 322, "the": 323, "Ġshall": 324, "ĠPart": 325, "ter": 326, "eapon": 327, "Ġde": 328, "ur": 329, "ther": 330, "pos": 331, "Ġthis": 332, "ies": 333, "ith": 334, "Ġre": 335, "ments": 336, "ll": 337, "Ġwith": 338, "Ġcon": 339, "Ġbe": 340, "Ġu": 341, "ive": 342, "ĠStates": 343, "Ġex": 344, "tic": 345, "pl": 346, "ate": 347, "ver": 348, "ul": 349, "der": 350, ".ĊĊ": 351, "ĠA": 352, "st": 353, "ig": 354, "ot": 355, "ational": 356, "Ġac": 357, "to": 358, "rtic": 359, "Ġother": 360, "Ġall": 361, "tern": 362, "ternational": 363, "rticle": 364, "posit": 365, "if": 366, "ial": 367, "ĠParties": 368, "ication": 369, "eg": 370, "Ġweapon": 371, "Ġany": 372, "ĠI": 373, "qu": 374, "ch": 375, "ble": 376, "Ġby": 377, "Ġr": 378, "Ġit": 379, "uch": 380, "nder": 381, "ir": 382, "Ġpro": 383, "op": 384, "ect": 385, "ard": 386, "Ġunder": 387, "ĠG": 388, "weapon": 389, "ure": 390, "ta": 391, "sion": 392, "ign": 393, "-weapon": 394, "Ġweapons": 395, "Ġsuch": 396, "Ġexpl": 397, "ĠParty": 398, "gy": 399, "eace": 400, "ci": 401, "ater": 402, "af": 403, "Ġpur": 404, "Ġpeace": 405, "Ġon": 406, "Ġforce": 407, "Ġexplos": 408, "Ġas": 409, "vern": 410, "ru": 411, "overn": 412, "lu": 413, "ification": 414, "ful": 415, "ergy": 416, ",ĊĊ": 417, "Ġwh": 418, "Ġpeaceful": 419, "Ġdev": 420, "ĠGovern": 421, "Ġent": 422, "ĠN": 423, "stru": 424, "se": 425, "men": 426, "ity": 427, "ire": 428, "de": 429, "clu": 430, "ations": 431, "atification": 432, "ance": 433, "Ġratification": 434, "Ġma": 435, "Ġinto": 436, "Ġinternational": 437, "Ġexplosive": 438, "Ġdevic": 439, "Ġco": 440, "Ġap": 441, "ĠE": 442, "uard": 443, "ri": 444, "nuclear": 445, "mic": 446, "gen": 447, "ff": 448, "eguard": 449, "ary": 450, "afeguard": 451, "Article": 452, "-nuclear": 453, "Ġthat": 454, "Ġsafeguard": 455, "Ġits": 456, "Ġinstru": 457, "Ġdevices": 458, "Ġdeposit": 459, "Ġdate": 460, "Ġacc": 461, "Ġag": 462, "ĠGovernments": 463, "si": 464, "ree": 465, "ly": 466, "ich": 467, "ct": 468, "aterial": 469, "Ġwhich": 470, "Ġsu": 471, "Ġso": 472, "Ġmaterial": 473, "Ġcont": 474, "Ġare": 475, "ĠState": 476, "ĠD": 477, "tak": 478, "te": 479, "poses": 480, "pec": 481, "mend": 482, "ie": 483, "genc": 484, "gency": 485, "eposit": 486, "able": 487, "Ġtheir": 488, "Ġnot": 489, "Ġnon": 490, "Ġagree": 491, "Ġarticle": 492, "Ġamend": 493, "ĠIn": 494, "ĠEn": 495, "ĠDeposit": 496, "ĠAgency": 497, "Ġh": 498, "Ġen": 499, "Ġat": 500, "vel": 501, "velop": 502, "tomic": 503, "rom": 504, "ord": 505, "ited": 506, "ignat": 507, "ge": 508, "ffect": 509, "Un": 510, "Ġundertak": 511, "Ġsafeguards": 512, "Ġpurposes": 513, "Ġman": 514, "Ġinstruments": 515, "Ġfrom": 516, "Ġdevelop": 517, "Ġamendment": 518, "ĠInternational": 519, "ĠEnergy": 520, "ĠDepositary": 521, "ĠAtomic": 522, "ĠUn": 523, "rol": 524, "ren": 525, "ry": 526, "ra": 527, "quire": 528, "pecial": 529, "ple": 530, "oti": 531, "ess": 532, "eration": 533, "egoti": 534, "ding": 535, "ach": 536, "Ġsub": 537, "Ġspecial": 538, "Ġob": 539, "Ġha": 540, "Ġdis": 541, "Ġconf": 542, "Ġappl": 543, "ĠUnited": 544, "ĠThe": 545, "ures": 546, "urther": 547, "ts": 548, "th": 549, "sionable": 550, "su": 551, "so": 552, "pro": 553, "pre": 554, "ordance": 555, "ory": 556, "ow": 557, "od": 558, "me": 559, "ject": 560, "issionable": 561, "igh": 562, "iv": 563, "ip": 564, "his": 565, "fter": 566, "ene": 567, "duc": 568, "cil": 569, "Ġundertakes": 570, "Ġsignat": 571, "Ġpos": 572, "Ġfurther": 573, "Ġfissionable": 574, "Ġfa": 575, "Ġentry": 576, "Ġenter": 577, "Ġeffect": 578, "Ġdevelopment": 579, "Ġcontrol": 580, "Ġcom": 581, "Ġapplication": 582, "Ġagreements": 583, "Ġaccordance": 584, "Ġafter": 585, "vie": 586, "urce": 587, "uf": 588, "ufa": 589, "ufact": 590, "ufacture": 591, "tain": 592, "tion": 593, "sible": 594, "rit": 595, "rin": 596, "rinci": 597, "orm": 598, "ol": 599, "min": 600, "ma": 601, "ist": 602, "irect": 603, "igned": 604, "ight": 605, "iz": 606, "hn": 607, "ession": 608, "echn": 609, "eas": 610, "eren": 611, "cluding": 612, "Ġuse": 613, "Ġtechn": 614, "Ġsource": 615, "Ġrequire": 616, "Ġpursu": 617, "Ġpossible": 618, "Ġprinci": 619, "Ġnegoti": 620, "Ġmanufacture": 621, "Ġmay": 622, "Ġfacil": 623, "Ġenergy": 624, "Ġeffective": 625, "Ġdes": 626, "Ġconferen": 627, "Ġcoop": 628, "Ġappro": 629, "Ġaccession": 630, "Ġar": 631, "ĠThis": 632, "ĠNations": 633, "Ġis": 634, "ĠF": 635, "view": 636, "vent": 637, "uly": 638, "ut": 639, "ted": 640, "riate": 641, "red": 642, "ran": 643, "rans": 644, "priate": 645, "ority": 646, "olo": 647, "mination": 648, "mament": 649, "ld": 650, "jority": 651, "ized": 652, "its": 653, "ities": 654, "irectly": 655, "ions": 656, "ical": 657, "il": 658, "id": 659, "here": 660, "hing": 661, "fits": 662, "fer": 663, "errit": 664, "eri": 665, "enefits": 666, "easures": 667, "em": 668, "clude": 669, "con": 670, "ated": 671, "armament": 672, "ant": 673, "ally": 674, "ay": 675, "as": 676, "II": 677, "Each": 678, "Ġus": 679, "Ġtechnolo": 680, "Ġtrans": 681, "Ġterrit": 682, "Ġsubject": 683, "Ġsignatory": 684, "Ġst": 685, "Ġse": 686, "Ġrequired": 687, "Ġright": 688, "Ġpursuant": 689, "Ġproduc": 690, "Ġprinciple": 691, "Ġmajority": 692, "Ġmeasures": 693, "Ġincluding": 694, "Ġhave": 695, "Ġequ": 696, "Ġdisarmament": 697, "Ġconference": 698, "Ġconv": 699, "Ġbenefits": 700, "Ġass": 701, "Ġappropriate": 702, "Ġapplications": 703, "Ġacce": 704, "Ġal": 705, "ĠNon": 706, "Ġl": 707, "ĠW": 708, "ĠV": 709, "ĠC": 710, "ye": 711, "year": 712, "years": 713, "vis": 714, "va": 715, "urity": 716, "uld": 717, "ute": 718, "us": 719, "un": 720, "ue": 721, "ty": 722, "tiv": 723, "tivities": 724, "sider": 725, "sear": 726, "search": 727, "rou": 728, "rea": 729, "ream": 730, "reamble": 731, "ques": 732, "pres": 733, "ould": 734, "otic": 735, "omic": 736, "ny": 737, "mence": 738, "mit": 739, "ke": 740, "ish": 741, "irc": 742, "ircul": 743, "ipment": 744, "iver": 745, "ill": 746, "hether": 747, "gical": 748, "form": 749, "essation": 750, "est": 751, "eriod": 752, "eral": 753, "ecurity": 754, "each": 755, "chan": 756, "change": 757, "ced": 758, "cess": 759, "and": 760, "alling": 761, "after": 762, "ace": 763, "Ġwithin": 764, "Ġwhether": 765, "Ġwar": 766, "Ġupon": 767, "Ġtransfer": 768, "Ġterritor": 769, "Ġtechnological": 770, "Ġta": 771, "Ġstr": 772, "Ġresearch": 773, "Ġrel": 774, "Ġreg": 775, "Ġrece": 776, "Ġproduction": 777, "Ġpropos": 778, "Ġprocess": 779, "Ġpre": 780, "Ġperiod": 781, "Ġpart": 782, "Ġorder": 783, "Ġone": 784, "Ġobtain": 785, "Ġover": 786, "Ġop": 787, "Ġnegotiations": 788, "Ġnotic": 789, "Ġinstrument": 790, "Ġinform": 791, "Ġind": 792, "Ġfacilit": 793, "Ġext": 794, "Ġexchange": 795, "Ġequipment": 796, "Ġdeposited": 797, "Ġdo": 798, "Ġdec": 799, "Ġcooperation": 800, "Ġconven": 801, "Ġcommence": 802, "Ġcircul": 803, "Ġcessation": 804, "Ġagreement": 805, "Ġactivities": 806, "ĠPreamble": 807, "ĠFor": 808, "ĠEach": 809, "ĠCh": 810, "ĠAny": 811, "Ġyears": 812, "Ġj": 813, "Ġg": 814, "Ġes": 815, "Ġeach": 816, "ĠJ": 817, "ĠB": 818, "yst": 819, "ystem": 820, "wis": 821, "wise": 822, "visions": 823, "vents": 824, "vail": 825, "vailable": 826, "vot": 827, "votes": 828, "ving": 829, "ust": 830, "ull": 831, "ullest": 832, "then": 833, "ths": 834, "tere": 835, "terest": 836, "terests": 837, "ton": 838, "soe": 839, "soever": 840, "sequ": 841, "sequent": 842, "sp": 843, "spect": 844, "sen": 845, "roug": 846, "rough": 847, "rib": 848, "reafter": 849, "raw": 850, "raord": 851, "raordin": 852, "raordinary": 853, "press": 854, "preme": 855, "plete": 856, "peci": 857, "pecially": 858, "pt": 859, "othing": 860, "osc": 861, "oscow": 862, "ormity": 863, "ort": 864, "ors": 865, "orld": 866, "opard": 867, "opardized": 868, "onths": 869, "one": 870, "ond": 871, "ondon": 872, "ous": 873, "ore": 874, "oll": 875, "ollow": 876, "oard": 877, "ner": 878, "mitted": 879, "ms": 880, "lish": 881, "land": 882, "jective": 883, "iversion": 884, "ition": 885, "ite": 886, "iring": 887, "ipate": 888, "inue": 889, "ignated": 890, "ific": 891, "iferation": 892, "ieve": 893, "ict": 894, "icipate": 895, "ix": 896, "ime": 897, "ied": 898, "ide": 899, "hington": 900, "hieve": 901, "har": 902, "harge": 903, "general": 904, "gether": 905, "ger": 906, "ers": 907, "erate": 908, "entific": 909, "end": 910, "emb": 911, "embers": 912, "ecalling": 913, "ex": 914, "eopardized": 915, "ek": 916, "eed": 917, "draw": 918, "conomic": 919, "cientific": 920, "cedures": 921, "cri": 922, "ces": 923, "atsoever": 924, "ating": 925, "ashington": 926, "arter": 927, "anger": 928, "als": 929, "ast": 930, "ain": 931, "Recalling": 932, "NE": 933, "Moscow": 934, "London": 935, "Con": 936, "'s": 937, "Ġwithdraw": 938, "Ġwhatsoever": 939, "Ġwould": 940, "Ġworld": 941, "Ġwill": 942, "Ġuses": 943, "Ġused": 944, "Ġundertake": 945, "Ġtogether": 946, "Ġthrough": 947, "Ġthan": 948, "Ġterritories": 949, "Ġtake": 950, "Ġtime": 951, "Ġtex": 952, "Ġsupreme": 953, "Ġstrict": 954, "Ġsignature": 955, "Ġset": 956, "Ġseek": 957, "Ġsafeguarding": 958, "Ġsystem": 959, "Ġsecurity": 960, "Ġscientific": 961, "Ġreceive": 962, "Ġreview": 963, "Ġrespect": 964, "Ġreso": 965, "Ġreques": 966, "Ġrace": 967, "Ġprocessing": 968, "Ġprovisions": 969, "Ġprom": 970, "Ġprevent": 971, "Ġparticipate": 972, "Ġotherwise": 973, "Ġoperation": 974, "Ġobjective": 975, "Ġout": 976, "Ġnotice": 977, "Ġneed": 978, "Ġnational": 979, "Ġmaterials": 980, "Ġmanner": 981, "Ġmust": 982, "Ġmonths": 983, "Ġmembers": 984, "Ġlater": 985, "Ġjeopardized": 986, "Ġinformation": 987, "Ġindirectly": 988, "Ġinterests": 989, "Ġinter": 990, "Ġint": 991, "Ġinde": 992, "Ġforth": 993, "Ġfacilitate": 994, "Ġfacility": 995, "Ġfullest": 996, "Ġfollow": 997, "Ġextraordinary": 998, "Ġexplosions": 999, "Ġespecially": 1000, "Ġevents": 1001, "Ġeff": 1002, "Ġeconomic": 1003, "Ġear": 1004, "Ġdesigned": 1005, "Ġdesignated": 1006, "Ġdiversion": 1007, "Ġdirectly": 1008, "Ġday": 1009, "Ġdanger": 1010, "Ġcooperate": 1011, "Ġconvening": 1012, "Ġcontrib": 1013, "Ġcontinue": 1014, "Ġconformity": 1015, "Ġconsider": 1016, "Ġconclude": 1017, "Ġconclu": 1018, "Ġcomplete": 1019, "Ġcirculated": 1020, "Ġcharge": 1021, "Ġcer": 1022, "Ġbeing": 1023, "Ġassist": 1024, "Ġarms": 1025, "Ġalso": 1026, "Ġalone": 1027, "Ġacceding": 1028, "Ġacquire": 1029, "Ġachieve": 1030, "Ġavailable": 1031, "Ġau": 1032, "Ġaffect": 1033, "Ġad": 1034, "ĠWashington": 1035, "ĠVII": 1036, "ĠStatute": 1037, "ĠSuch": 1038, "ĠSo": 1039, "ĠNegoti": 1040, "ĠJuly": 1041, "ĠIV": 1042, "ĠII": 1043, "ĠGovernors": 1044, "ĠCharter": 1045, "ĠBoard": 1046, "Ġvotes": 1047, "Ġview": 1048, "Ġif": 1049, "Ġhere": 1050, "Ġgeneral": 1051, "ĠX": 1052, "ĠR": 1053, "ĠMoscow": 1054, "ĠLondon": 1055, "Ġ(": 1056}